package com.vszone.ko.battlechannel.demo;

import android.app.Application;
import cn.vszone.ko.log.Logger;
import cn.vszone.ko.tv.battle.channel.KoBattleApplicationImpl;

public class DemoApplication extends Application {

    // ===========================================================
    // Constants
    // +==========================================================
    private static final Logger LOG = Logger.getLogger(DemoApplication.class);

    //TODO 代码在+-号之间编写
    // -==========================================================

    // ===========================================================
    // Fields
    // +==========================================================

    private KoBattleApplicationImpl mAppImpl;

    // -==========================================================

    // ===========================================================
    // Constructors
    // +==========================================================

    //TODO 代码在+-号之间编写

    // -==========================================================

    // ===========================================================
    // Getter & Setter
    // +==========================================================

    //TODO 代码在+-号之间编写

    // -==========================================================

    // ===========================================================
    // Methods for/from SuperClass/Interfaces
    // +==========================================================

    @Override
    public void onCreate() {
        super.onCreate();
        mAppImpl = new KoBattleApplicationImpl();
        mAppImpl.onCreate(this);
    }
    
    @Override
    public void onLowMemory() {
        super.onLowMemory();
        mAppImpl.onLowMemory();
    }

    // -==========================================================

    // ===========================================================
    // Methods
    // +==========================================================

    //TODO 代码在+-号之间编写

    // -==========================================================

    // ===========================================================
    // Inner and Anonymous Classes
    // +==========================================================

    //TODO 代码在+-号之间编写

    // -==========================================================
}
